# ==========================================
# Homebrew Bundle 依赖清单
# ==========================================

# --- Infrastructure (基础设施) ---
# 软链管理工具，本 Dotfiles 的核心管理工具
brew "stow"
# 版本控制系统
brew "git"
# 语言/工具版本管理器 (替代 asdf/nvm/pyenv)
brew "mise"

# --- Shell & Terminal (Shell 环境) ---
# 现代化交互式 Shell
brew "fish"
# 终端复用器，提供多窗口/分屏体验
brew "zellij"
# 智能目录跳转工具 (替代 cd)，支持权重记忆
brew "zoxide"
# 通用模糊搜索工具
brew "fzf"

# --- Editor (编辑器) ---
# 现代化模态编辑器 (后现代 Vim)，开箱即用
brew "helix"

# === CLI Enhancements (命令行增强) ===
# All-in-one LLM CLI tool (内建终端 AI 助手)
brew "aichat"
# Git diff 语法高亮与美化工具
brew "git-delta"
# 通用日志/输出着色器
brew "grc"

# --- System Utilities (系统工具) ---
# GNU 版本的 awk, sed, grep (macOS 自带的是 BSD 版本，功能较弱)
brew "gawk"
brew "gnu-sed"
brew "grep"
# 网络文件下载工具
brew "wget"
# 命令行音频设备切换工具
brew "switchaudio-osx"
# 现代、跨平台的系统资源监控工具
brew "btop"

# --- GUI Applications (图形界面应用) ---
# Ghostty 终端 (@tip 表示安装最新开发版)
cask "ghostty@tip"
# JetBrains Mono 字体 (带 Nerd Font 图标)
cask "font-jetbrains-mono-nerd-font"
# 轻量级 Docker 容器与 Linux 虚拟机管理工具 (替代 Docker Desktop)
cask "orbstack"
# 轻量级 macOS 截图标注工具
cask "shottr"
# 全局键位映射工具
cask "karabiner-elements"
